Autodesk.Revit.DB.CurveArray
An array that can contain curves.

Autodesk.Revit.DB.CurveArray.Insert(Autodesk.Revit.DB.Curve,System.Int32)
System.Int32
Insert the specified curve into the array.
item: The curve to be inserted into the array.
index: The curve will be inserted before this index.
Returns: Returns whether the curve was inserted into the array.

Autodesk.Revit.DB.CurveArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.CurveArray.ReverseIterator
Autodesk.Revit.DB.CurveArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.CurveArray.ForwardIterator
Autodesk.Revit.DB.CurveArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.CurveArray.Append(Autodesk.Revit.DB.Curve)
void
Add the curve to the end of the array.
item: The curve to be added.

Autodesk.Revit.DB.CurveArray.Clear
void
Removes every curve from the array, rendering it empty.

Autodesk.Revit.DB.CurveArray.Size
System.Int32
get
Returns the number of curves that are in the array.

Autodesk.Revit.DB.CurveArray.Item(System.Int32)
System.Object
Gets or sets a curve at a specified index within the array.
index: The index of the curve to be set or retrieved.
Returns: Returns the curve at the specified index.

Autodesk.Revit.DB.CurveArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.